Console.WriteLine("INFO");

/*
1. Завдання: пошук повідомлень через Broadcast + TCP

Створити два консольних застосунки:

Broadcast Server
Broadcast Client
Опис роботи
Сервер

Сервер повинен:

запускати TCP-сервер на певному порті;
генерувати випадкові повідомлення;
для кожного повідомлення створювати:
випадковий ID;
текст повідомлення з готового набору фраз;
через випадковий проміжок часу (наприклад 2–7 секунд) надсилати Broadcast-повідомлення по UDP.

Broadcast-повідомлення повинно містити:

IP-адресу сервера;
TCP-порт;
ID повідомлення.

Приклад:

192.168.0.15:7000:845
TCP частина сервера

TCP-сервер повинен:

приймати підключення від клієнтів;
отримувати ID повідомлення;
знаходити текст повідомлення за цим ID;
відправляти клієнту повний текст повідомлення.
Клієнт

Клієнт повинен:

прослуховувати UDP Broadcast;
отримувати:
IP-адресу;
TCP-порт;
ID повідомлення;
підключатися до сервера через TCP;
надсилати ID повідомлення;
отримувати повний текст;
виводити його у консоль.
Приклад роботи
Broadcast повідомлення
192.168.0.15:7000:845
Клієнт підключається через TCP

Відправляє:

845
Сервер відповідає
System temperature is normal
Набір можливих повідомлень

Наприклад:

Server started
New client connected
CPU usage is high
Backup completed
System temperature is normal
Database synchronized

----

2. Завдання: Синхронізація папок через мережу

Створити два консольних застосунки:

* Sync Server
* Sync Client

Сервер повинен стежити за певною папкою.

Якщо в папці:

* створено новий файл;
* змінено файл;
* видалено файл;

сервер повинен надсилати UDP Broadcast-повідомлення про зміну.

Повідомлення повинно містити тип зміни, назву файлу, IP-адресу та TCP-порт сервера.

Приклади:

CREATE|test.txt
CHANGE|document.pdf
DELETE|image.jpg

Клієнт повинен прослуховувати UDP Broadcast-повідомлення.

Після отримання повідомлення:

* CREATE — підключитися до сервера через TCP та завантажити новий файл у свою папку;
* CHANGE — підключитися до сервера через TCP та завантажити актуальну версію файлу;
* DELETE — видалити відповідний файл зі своєї папки.

У результаті папка клієнта повинна автоматично синхронізуватися з папкою сервера.

Для відстеження змін використати FileSystemWatcher.

Для пошуку сервера використати UDP Broadcast.

Для передачі файлів використати TCP.
*/